Tekla.Structures.Model.PolygonWeld
The PolygonWeld class represents a polygon weld in the model.
A polygon weld has a main part and a secondary part.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
Point Beam1P1 = new Point(6000, 12000, 0);
Point Beam1P2 = new Point(9000, 12000, 0);
Point Beam2P1 = new Point(9000, 12000, 0);
Point Beam2P2 = new Point(9000, 18000, 0);
Beam Beam1 = new Beam(Beam1P1, Beam1P2);
Beam Beam2 = new Beam(Beam2P1, Beam2P2);
Beam1.Profile.ProfileString = "HEA400";
Beam1.Finish = "PAINT";
Beam1.Name = "Beam 1";
Beam2.Profile.ProfileString = "HEA400";
Beam2.Finish = "PAINT";
Beam2.Name = "Beam 2";
Beam1.Insert();
Beam2.Insert();
PolygonWeld PolygonWeld = new PolygonWeld();
PolygonWeld.MainObject = Beam1;
PolygonWeld.SecondaryObject = Beam2;
Point WeldP1 = new Point(9000, 11850, 0);
Point WeldP2 = new Point(9000, 12000, 0);
Point WeldP3 = new Point(9150, 12000, 0);
PolygonWeld.Polygon.Points.Add(WeldP1);
PolygonWeld.Polygon.Points.Add(WeldP2);
PolygonWeld.Polygon.Points.Add(WeldP3);
PolygonWeld.TypeAbove = PolygonWeld.WeldTypeEnum.WELD_TYPE_SQUARE_GROOVE_SQUARE_BUTT;
PolygonWeld.Insert();
PolygonWeld.TypeBelow = PolygonWeld.WeldTypeEnum.WELD_TYPE_SLOT;
PolygonWeld.Modify();
}
}

Tekla.Structures.Model.PolygonWeld.Polygon
The polygon for the polygon weld.

Tekla.Structures.Model.PolygonWeld.#ctor
Creates a new polygon weld instance.

Tekla.Structures.Model.PolygonWeld.Insert
Inserts the polygon weld into the model database. All the attributes must be set.
Returns: True on success.

Tekla.Structures.Model.PolygonWeld.Select
Selects a polygon weld from the model database. The polygon weld identifier must be set.
Returns: True on success.

Tekla.Structures.Model.PolygonWeld.Modify
Modifies the existing polygon weld in the model database to match the current one.
The modification cannot be done if the polygon weld is a part of a logical weld.
Returns: True on success.

Tekla.Structures.Model.PolygonWeld.Delete
Deletes the polygon weld instance with the given identifier from the model database.
Returns: True on success.

Tekla.Structures.Model.PolygonWeld.GetLogicalWeld(Tekla.Structures.Model.LogicalWeld@)
Gets the logical weld where the weld belongs. Returns false if
the weld does not belong to any logical weld.
LogicalWeld: An initialized logical weld object.
Returns: True if the logical weld was selected correctly; false otherwise.